zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc55xxx/pinctrl/LPC5506JHI48-pinctrl.h
/*
 * NOTE: File generated by gen_soc_headers.py
 * from LPC5506JHI48/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on LPC55S69JBD100-pinctrl.h with this part's differences applied
 * below (1890 removed, 0 changed,
 * 5 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: d0fef7b5a4939490
 */

#ifndef _ZEPHYR_DTS_BINDING_LPC5506JHI48_WRAPPER_
#define _ZEPHYR_DTS_BINDING_LPC5506JHI48_WRAPPER_

#include "LPC55S69JBD100-pinctrl.h"

/* Signals not present on this part */
#undef ACMPVREF_PIO1_19
#undef ADC0_CH12_PIO1_9
#undef ADC0_CH3_PIO0_31
#undef ADC0_CH4_PIO1_8
#undef CLKOUT_PIO1_27
#undef CMP0_OUT_PIO0_1
#undef CTIMER0_CAPTURE0_PIO0_1
#undef CTIMER0_CAPTURE0_PIO0_24
#undef CTIMER0_CAPTURE0_PIO0_28
#undef CTIMER0_CAPTURE0_PIO1_11
#undef CTIMER0_CAPTURE0_PIO1_13
#undef CTIMER0_CAPTURE0_PIO1_15
#undef CTIMER0_CAPTURE0_PIO1_20
#undef CTIMER0_CAPTURE0_PIO1_26
#undef CTIMER0_CAPTURE0_PIO1_28
#undef CTIMER0_CAPTURE0_PIO1_9
#undef CTIMER0_CAPTURE1_PIO0_1
#undef CTIMER0_CAPTURE1_PIO0_24
#undef CTIMER0_CAPTURE1_PIO0_28
#undef CTIMER0_CAPTURE1_PIO1_11
#undef CTIMER0_CAPTURE1_PIO1_13
#undef CTIMER0_CAPTURE1_PIO1_15
#undef CTIMER0_CAPTURE1_PIO1_20
#undef CTIMER0_CAPTURE1_PIO1_26
#undef CTIMER0_CAPTURE1_PIO1_28
#undef CTIMER0_CAPTURE1_PIO1_9
#undef CTIMER0_CAPTURE2_PIO0_1
#undef CTIMER0_CAPTURE2_PIO0_24
#undef CTIMER0_CAPTURE2_PIO0_28
#undef CTIMER0_CAPTURE2_PIO1_11
#undef CTIMER0_CAPTURE2_PIO1_13
#undef CTIMER0_CAPTURE2_PIO1_15
#undef CTIMER0_CAPTURE2_PIO1_20
#undef CTIMER0_CAPTURE2_PIO1_26
#undef CTIMER0_CAPTURE2_PIO1_28
#undef CTIMER0_CAPTURE2_PIO1_9
#undef CTIMER0_CAPTURE3_PIO0_1
#undef CTIMER0_CAPTURE3_PIO0_24
#undef CTIMER0_CAPTURE3_PIO0_28
#undef CTIMER0_CAPTURE3_PIO1_11
#undef CTIMER0_CAPTURE3_PIO1_13
#undef CTIMER0_CAPTURE3_PIO1_15
#undef CTIMER0_CAPTURE3_PIO1_20
#undef CTIMER0_CAPTURE3_PIO1_26
#undef CTIMER0_CAPTURE3_PIO1_28
#undef CTIMER0_CAPTURE3_PIO1_9
#undef CTIMER0_MATCH0_PIO0_0
#undef CTIMER0_MATCH1_PIO0_31
#undef CTIMER0_MATCH2_PIO0_19
#undef CTIMER0_MATCH2_PIO1_31
#undef CTIMER0_MATCH3_PIO1_27
#undef CTIMER1_CAPTURE0_PIO0_1
#undef CTIMER1_CAPTURE0_PIO0_24
#undef CTIMER1_CAPTURE0_PIO0_28
#undef CTIMER1_CAPTURE0_PIO1_11
#undef CTIMER1_CAPTURE0_PIO1_13
#undef CTIMER1_CAPTURE0_PIO1_15
#undef CTIMER1_CAPTURE0_PIO1_20
#undef CTIMER1_CAPTURE0_PIO1_26
#undef CTIMER1_CAPTURE0_PIO1_28
#undef CTIMER1_CAPTURE0_PIO1_9
#undef CTIMER1_CAPTURE1_PIO0_1
#undef CTIMER1_CAPTURE1_PIO0_24
#undef CTIMER1_CAPTURE1_PIO0_28
#undef CTIMER1_CAPTURE1_PIO1_11
#undef CTIMER1_CAPTURE1_PIO1_13
#undef CTIMER1_CAPTURE1_PIO1_15
#undef CTIMER1_CAPTURE1_PIO1_20
#undef CTIMER1_CAPTURE1_PIO1_26
#undef CTIMER1_CAPTURE1_PIO1_28
#undef CTIMER1_CAPTURE1_PIO1_9
#undef CTIMER1_CAPTURE2_PIO0_1
#undef CTIMER1_CAPTURE2_PIO0_24
#undef CTIMER1_CAPTURE2_PIO0_28
#undef CTIMER1_CAPTURE2_PIO1_11
#undef CTIMER1_CAPTURE2_PIO1_13
#undef CTIMER1_CAPTURE2_PIO1_15
#undef CTIMER1_CAPTURE2_PIO1_20
#undef CTIMER1_CAPTURE2_PIO1_26
#undef CTIMER1_CAPTURE2_PIO1_28
#undef CTIMER1_CAPTURE2_PIO1_9
#undef CTIMER1_CAPTURE3_PIO0_1
#undef CTIMER1_CAPTURE3_PIO0_24
#undef CTIMER1_CAPTURE3_PIO0_28
#undef CTIMER1_CAPTURE3_PIO1_11
#undef CTIMER1_CAPTURE3_PIO1_13
#undef CTIMER1_CAPTURE3_PIO1_15
#undef CTIMER1_CAPTURE3_PIO1_20
#undef CTIMER1_CAPTURE3_PIO1_26
#undef CTIMER1_CAPTURE3_PIO1_28
#undef CTIMER1_CAPTURE3_PIO1_9
#undef CTIMER1_MATCH0_PIO0_18
#undef CTIMER1_MATCH0_PIO1_10
#undef CTIMER1_MATCH1_PIO1_12
#undef CTIMER1_MATCH2_PIO1_14
#undef CTIMER1_MATCH3_PIO1_16
#undef CTIMER2_CAPTURE0_PIO0_1
#undef CTIMER2_CAPTURE0_PIO0_24
#undef CTIMER2_CAPTURE0_PIO0_28
#undef CTIMER2_CAPTURE0_PIO1_11
#undef CTIMER2_CAPTURE0_PIO1_13
#undef CTIMER2_CAPTURE0_PIO1_15
#undef CTIMER2_CAPTURE0_PIO1_20
#undef CTIMER2_CAPTURE0_PIO1_26
#undef CTIMER2_CAPTURE0_PIO1_28
#undef CTIMER2_CAPTURE0_PIO1_9
#undef CTIMER2_CAPTURE1_PIO0_1
#undef CTIMER2_CAPTURE1_PIO0_24
#undef CTIMER2_CAPTURE1_PIO0_28
#undef CTIMER2_CAPTURE1_PIO1_11
#undef CTIMER2_CAPTURE1_PIO1_13
#undef CTIMER2_CAPTURE1_PIO1_15
#undef CTIMER2_CAPTURE1_PIO1_20
#undef CTIMER2_CAPTURE1_PIO1_26
#undef CTIMER2_CAPTURE1_PIO1_28
#undef CTIMER2_CAPTURE1_PIO1_9
#undef CTIMER2_CAPTURE2_PIO0_1
#undef CTIMER2_CAPTURE2_PIO0_24
#undef CTIMER2_CAPTURE2_PIO0_28
#undef CTIMER2_CAPTURE2_PIO1_11
#undef CTIMER2_CAPTURE2_PIO1_13
#undef CTIMER2_CAPTURE2_PIO1_15
#undef CTIMER2_CAPTURE2_PIO1_20
#undef CTIMER2_CAPTURE2_PIO1_26
#undef CTIMER2_CAPTURE2_PIO1_28
#undef CTIMER2_CAPTURE2_PIO1_9
#undef CTIMER2_CAPTURE3_PIO0_1
#undef CTIMER2_CAPTURE3_PIO0_24
#undef CTIMER2_CAPTURE3_PIO0_28
#undef CTIMER2_CAPTURE3_PIO1_11
#undef CTIMER2_CAPTURE3_PIO1_13
#undef CTIMER2_CAPTURE3_PIO1_15
#undef CTIMER2_CAPTURE3_PIO1_20
#undef CTIMER2_CAPTURE3_PIO1_26
#undef CTIMER2_CAPTURE3_PIO1_28
#undef CTIMER2_CAPTURE3_PIO1_9
#undef CTIMER2_MATCH1_PIO1_6
#undef CTIMER2_MATCH2_PIO1_7
#undef CTIMER2_MATCH3_PIO1_22
#undef CTIMER3_CAPTURE0_PIO0_1
#undef CTIMER3_CAPTURE0_PIO0_24
#undef CTIMER3_CAPTURE0_PIO0_28
#undef CTIMER3_CAPTURE0_PIO1_11
#undef CTIMER3_CAPTURE0_PIO1_13
#undef CTIMER3_CAPTURE0_PIO1_15
#undef CTIMER3_CAPTURE0_PIO1_20
#undef CTIMER3_CAPTURE0_PIO1_26
#undef CTIMER3_CAPTURE0_PIO1_28
#undef CTIMER3_CAPTURE0_PIO1_9
#undef CTIMER3_CAPTURE1_PIO0_1
#undef CTIMER3_CAPTURE1_PIO0_24
#undef CTIMER3_CAPTURE1_PIO0_28
#undef CTIMER3_CAPTURE1_PIO1_11
#undef CTIMER3_CAPTURE1_PIO1_13
#undef CTIMER3_CAPTURE1_PIO1_15
#undef CTIMER3_CAPTURE1_PIO1_20
#undef CTIMER3_CAPTURE1_PIO1_26
#undef CTIMER3_CAPTURE1_PIO1_28
#undef CTIMER3_CAPTURE1_PIO1_9
#undef CTIMER3_CAPTURE2_PIO0_1
#undef CTIMER3_CAPTURE2_PIO0_24
#undef CTIMER3_CAPTURE2_PIO0_28
#undef CTIMER3_CAPTURE2_PIO1_11
#undef CTIMER3_CAPTURE2_PIO1_13
#undef CTIMER3_CAPTURE2_PIO1_15
#undef CTIMER3_CAPTURE2_PIO1_20
#undef CTIMER3_CAPTURE2_PIO1_26
#undef CTIMER3_CAPTURE2_PIO1_28
#undef CTIMER3_CAPTURE2_PIO1_9
#undef CTIMER3_CAPTURE3_PIO0_1
#undef CTIMER3_CAPTURE3_PIO0_24
#undef CTIMER3_CAPTURE3_PIO0_28
#undef CTIMER3_CAPTURE3_PIO1_11
#undef CTIMER3_CAPTURE3_PIO1_13
#undef CTIMER3_CAPTURE3_PIO1_15
#undef CTIMER3_CAPTURE3_PIO1_20
#undef CTIMER3_CAPTURE3_PIO1_26
#undef CTIMER3_CAPTURE3_PIO1_28
#undef CTIMER3_CAPTURE3_PIO1_9
#undef CTIMER3_MATCH1_PIO1_19
#undef CTIMER4_CAPTURE0_PIO0_1
#undef CTIMER4_CAPTURE0_PIO0_24
#undef CTIMER4_CAPTURE0_PIO0_28
#undef CTIMER4_CAPTURE0_PIO1_11
#undef CTIMER4_CAPTURE0_PIO1_13
#undef CTIMER4_CAPTURE0_PIO1_15
#undef CTIMER4_CAPTURE0_PIO1_20
#undef CTIMER4_CAPTURE0_PIO1_26
#undef CTIMER4_CAPTURE0_PIO1_28
#undef CTIMER4_CAPTURE0_PIO1_9
#undef CTIMER4_CAPTURE1_PIO0_1
#undef CTIMER4_CAPTURE1_PIO0_24
#undef CTIMER4_CAPTURE1_PIO0_28
#undef CTIMER4_CAPTURE1_PIO1_11
#undef CTIMER4_CAPTURE1_PIO1_13
#undef CTIMER4_CAPTURE1_PIO1_15
#undef CTIMER4_CAPTURE1_PIO1_20
#undef CTIMER4_CAPTURE1_PIO1_26
#undef CTIMER4_CAPTURE1_PIO1_28
#undef CTIMER4_CAPTURE1_PIO1_9
#undef CTIMER4_CAPTURE2_PIO0_1
#undef CTIMER4_CAPTURE2_PIO0_24
#undef CTIMER4_CAPTURE2_PIO0_28
#undef CTIMER4_CAPTURE2_PIO1_11
#undef CTIMER4_CAPTURE2_PIO1_13
#undef CTIMER4_CAPTURE2_PIO1_15
#undef CTIMER4_CAPTURE2_PIO1_20
#undef CTIMER4_CAPTURE2_PIO1_26
#undef CTIMER4_CAPTURE2_PIO1_28
#undef CTIMER4_CAPTURE2_PIO1_9
#undef CTIMER4_CAPTURE3_PIO0_1
#undef CTIMER4_CAPTURE3_PIO0_24
#undef CTIMER4_CAPTURE3_PIO0_28
#undef CTIMER4_CAPTURE3_PIO1_11
#undef CTIMER4_CAPTURE3_PIO1_13
#undef CTIMER4_CAPTURE3_PIO1_15
#undef CTIMER4_CAPTURE3_PIO1_20
#undef CTIMER4_CAPTURE3_PIO1_26
#undef CTIMER4_CAPTURE3_PIO1_28
#undef CTIMER4_CAPTURE3_PIO1_9
#undef DMA0_TRIG00_PIO0_0
#undef DMA0_TRIG00_PIO0_1
#undef DMA0_TRIG00_PIO0_17
#undef DMA0_TRIG00_PIO0_18
#undef DMA0_TRIG00_PIO0_19
#undef DMA0_TRIG00_PIO0_24
#undef DMA0_TRIG00_PIO0_28
#undef DMA0_TRIG00_PIO0_31
#undef DMA0_TRIG00_PIO0_7
#undef DMA0_TRIG00_PIO1_10
#undef DMA0_TRIG00_PIO1_11
#undef DMA0_TRIG00_PIO1_12
#undef DMA0_TRIG00_PIO1_13
#undef DMA0_TRIG00_PIO1_14
#undef DMA0_TRIG00_PIO1_15
#undef DMA0_TRIG00_PIO1_16
#undef DMA0_TRIG00_PIO1_17
#undef DMA0_TRIG00_PIO1_18
#undef DMA0_TRIG00_PIO1_19
#undef DMA0_TRIG00_PIO1_20
#undef DMA0_TRIG00_PIO1_22
#undef DMA0_TRIG00_PIO1_23
#undef DMA0_TRIG00_PIO1_24
#undef DMA0_TRIG00_PIO1_25
#undef DMA0_TRIG00_PIO1_26
#undef DMA0_TRIG00_PIO1_27
#undef DMA0_TRIG00_PIO1_28
#undef DMA0_TRIG00_PIO1_29
#undef DMA0_TRIG00_PIO1_30
#undef DMA0_TRIG00_PIO1_31
#undef DMA0_TRIG00_PIO1_6
#undef DMA0_TRIG00_PIO1_7
#undef DMA0_TRIG00_PIO1_8
#undef DMA0_TRIG00_PIO1_9
#undef DMA0_TRIG010_PIO0_0
#undef DMA0_TRIG010_PIO0_1
#undef DMA0_TRIG010_PIO0_17
#undef DMA0_TRIG010_PIO0_18
#undef DMA0_TRIG010_PIO0_19
#undef DMA0_TRIG010_PIO0_24
#undef DMA0_TRIG010_PIO0_28
#undef DMA0_TRIG010_PIO0_31
#undef DMA0_TRIG010_PIO0_7
#undef DMA0_TRIG010_PIO1_10
#undef DMA0_TRIG010_PIO1_11
#undef DMA0_TRIG010_PIO1_12
#undef DMA0_TRIG010_PIO1_13
#undef DMA0_TRIG010_PIO1_14
#undef DMA0_TRIG010_PIO1_15
#undef DMA0_TRIG010_PIO1_16
#undef DMA0_TRIG010_PIO1_17
#undef DMA0_TRIG010_PIO1_18
#undef DMA0_TRIG010_PIO1_19
#undef DMA0_TRIG010_PIO1_20
#undef DMA0_TRIG010_PIO1_22
#undef DMA0_TRIG010_PIO1_23
#undef DMA0_TRIG010_PIO1_24
#undef DMA0_TRIG010_PIO1_25
#undef DMA0_TRIG010_PIO1_26
#undef DMA0_TRIG010_PIO1_27
#undef DMA0_TRIG010_PIO1_28
#undef DMA0_TRIG010_PIO1_29
#undef DMA0_TRIG010_PIO1_30
#undef DMA0_TRIG010_PIO1_31
#undef DMA0_TRIG010_PIO1_6
#undef DMA0_TRIG010_PIO1_7
#undef DMA0_TRIG010_PIO1_8
#undef DMA0_TRIG010_PIO1_9
#undef DMA0_TRIG011_PIO0_0
#undef DMA0_TRIG011_PIO0_1
#undef DMA0_TRIG011_PIO0_17
#undef DMA0_TRIG011_PIO0_18
#undef DMA0_TRIG011_PIO0_19
#undef DMA0_TRIG011_PIO0_24
#undef DMA0_TRIG011_PIO0_28
#undef DMA0_TRIG011_PIO0_31
#undef DMA0_TRIG011_PIO0_7
#undef DMA0_TRIG011_PIO1_10
#undef DMA0_TRIG011_PIO1_11
#undef DMA0_TRIG011_PIO1_12
#undef DMA0_TRIG011_PIO1_13
#undef DMA0_TRIG011_PIO1_14
#undef DMA0_TRIG011_PIO1_15
#undef DMA0_TRIG011_PIO1_16
#undef DMA0_TRIG011_PIO1_17
#undef DMA0_TRIG011_PIO1_18
#undef DMA0_TRIG011_PIO1_19
#undef DMA0_TRIG011_PIO1_20
#undef DMA0_TRIG011_PIO1_22
#undef DMA0_TRIG011_PIO1_23
#undef DMA0_TRIG011_PIO1_24
#undef DMA0_TRIG011_PIO1_25
#undef DMA0_TRIG011_PIO1_26
#undef DMA0_TRIG011_PIO1_27
#undef DMA0_TRIG011_PIO1_28
#undef DMA0_TRIG011_PIO1_29
#undef DMA0_TRIG011_PIO1_30
#undef DMA0_TRIG011_PIO1_31
#undef DMA0_TRIG011_PIO1_6
#undef DMA0_TRIG011_PIO1_7
#undef DMA0_TRIG011_PIO1_8
#undef DMA0_TRIG011_PIO1_9
#undef DMA0_TRIG012_PIO0_0
#undef DMA0_TRIG012_PIO0_1
#undef DMA0_TRIG012_PIO0_17
#undef DMA0_TRIG012_PIO0_18
#undef DMA0_TRIG012_PIO0_19
#undef DMA0_TRIG012_PIO0_24
#undef DMA0_TRIG012_PIO0_28
#undef DMA0_TRIG012_PIO0_31
#undef DMA0_TRIG012_PIO0_7
#undef DMA0_TRIG012_PIO1_10
#undef DMA0_TRIG012_PIO1_11
#undef DMA0_TRIG012_PIO1_12
#undef DMA0_TRIG012_PIO1_13
#undef DMA0_TRIG012_PIO1_14
#undef DMA0_TRIG012_PIO1_15
#undef DMA0_TRIG012_PIO1_16
#undef DMA0_TRIG012_PIO1_17
#undef DMA0_TRIG012_PIO1_18
#undef DMA0_TRIG012_PIO1_19
#undef DMA0_TRIG012_PIO1_20
#undef DMA0_TRIG012_PIO1_22
#undef DMA0_TRIG012_PIO1_23
#undef DMA0_TRIG012_PIO1_24
#undef DMA0_TRIG012_PIO1_25
#undef DMA0_TRIG012_PIO1_26
#undef DMA0_TRIG012_PIO1_27
#undef DMA0_TRIG012_PIO1_28
#undef DMA0_TRIG012_PIO1_29
#undef DMA0_TRIG012_PIO1_30
#undef DMA0_TRIG012_PIO1_31
#undef DMA0_TRIG012_PIO1_6
#undef DMA0_TRIG012_PIO1_7
#undef DMA0_TRIG012_PIO1_8
#undef DMA0_TRIG012_PIO1_9
#undef DMA0_TRIG013_PIO0_0
#undef DMA0_TRIG013_PIO0_1
#undef DMA0_TRIG013_PIO0_17
#undef DMA0_TRIG013_PIO0_18
#undef DMA0_TRIG013_PIO0_19
#undef DMA0_TRIG013_PIO0_24
#undef DMA0_TRIG013_PIO0_28
#undef DMA0_TRIG013_PIO0_31
#undef DMA0_TRIG013_PIO0_7
#undef DMA0_TRIG013_PIO1_10
#undef DMA0_TRIG013_PIO1_11
#undef DMA0_TRIG013_PIO1_12
#undef DMA0_TRIG013_PIO1_13
#undef DMA0_TRIG013_PIO1_14
#undef DMA0_TRIG013_PIO1_15
#undef DMA0_TRIG013_PIO1_16
#undef DMA0_TRIG013_PIO1_17
#undef DMA0_TRIG013_PIO1_18
#undef DMA0_TRIG013_PIO1_19
#undef DMA0_TRIG013_PIO1_20
#undef DMA0_TRIG013_PIO1_22
#undef DMA0_TRIG013_PIO1_23
#undef DMA0_TRIG013_PIO1_24
#undef DMA0_TRIG013_PIO1_25
#undef DMA0_TRIG013_PIO1_26
#undef DMA0_TRIG013_PIO1_27
#undef DMA0_TRIG013_PIO1_28
#undef DMA0_TRIG013_PIO1_29
#undef DMA0_TRIG013_PIO1_30
#undef DMA0_TRIG013_PIO1_31
#undef DMA0_TRIG013_PIO1_6
#undef DMA0_TRIG013_PIO1_7
#undef DMA0_TRIG013_PIO1_8
#undef DMA0_TRIG013_PIO1_9
#undef DMA0_TRIG014_PIO0_0
#undef DMA0_TRIG014_PIO0_1
#undef DMA0_TRIG014_PIO0_17
#undef DMA0_TRIG014_PIO0_18
#undef DMA0_TRIG014_PIO0_19
#undef DMA0_TRIG014_PIO0_24
#undef DMA0_TRIG014_PIO0_28
#undef DMA0_TRIG014_PIO0_31
#undef DMA0_TRIG014_PIO0_7
#undef DMA0_TRIG014_PIO1_10
#undef DMA0_TRIG014_PIO1_11
#undef DMA0_TRIG014_PIO1_12
#undef DMA0_TRIG014_PIO1_13
#undef DMA0_TRIG014_PIO1_14
#undef DMA0_TRIG014_PIO1_15
#undef DMA0_TRIG014_PIO1_16
#undef DMA0_TRIG014_PIO1_17
#undef DMA0_TRIG014_PIO1_18
#undef DMA0_TRIG014_PIO1_19
#undef DMA0_TRIG014_PIO1_20
#undef DMA0_TRIG014_PIO1_22
#undef DMA0_TRIG014_PIO1_23
#undef DMA0_TRIG014_PIO1_24
#undef DMA0_TRIG014_PIO1_25
#undef DMA0_TRIG014_PIO1_26
#undef DMA0_TRIG014_PIO1_27
#undef DMA0_TRIG014_PIO1_28
#undef DMA0_TRIG014_PIO1_29
#undef DMA0_TRIG014_PIO1_30
#undef DMA0_TRIG014_PIO1_31
#undef DMA0_TRIG014_PIO1_6
#undef DMA0_TRIG014_PIO1_7
#undef DMA0_TRIG014_PIO1_8
#undef DMA0_TRIG014_PIO1_9
#undef DMA0_TRIG015_PIO0_0
#undef DMA0_TRIG015_PIO0_1
#undef DMA0_TRIG015_PIO0_17
#undef DMA0_TRIG015_PIO0_18
#undef DMA0_TRIG015_PIO0_19
#undef DMA0_TRIG015_PIO0_24
#undef DMA0_TRIG015_PIO0_28
#undef DMA0_TRIG015_PIO0_31
#undef DMA0_TRIG015_PIO0_7
#undef DMA0_TRIG015_PIO1_10
#undef DMA0_TRIG015_PIO1_11
#undef DMA0_TRIG015_PIO1_12
#undef DMA0_TRIG015_PIO1_13
#undef DMA0_TRIG015_PIO1_14
#undef DMA0_TRIG015_PIO1_15
#undef DMA0_TRIG015_PIO1_16
#undef DMA0_TRIG015_PIO1_17
#undef DMA0_TRIG015_PIO1_18
#undef DMA0_TRIG015_PIO1_19
#undef DMA0_TRIG015_PIO1_20
#undef DMA0_TRIG015_PIO1_22
#undef DMA0_TRIG015_PIO1_23
#undef DMA0_TRIG015_PIO1_24
#undef DMA0_TRIG015_PIO1_25
#undef DMA0_TRIG015_PIO1_26
#undef DMA0_TRIG015_PIO1_27
#undef DMA0_TRIG015_PIO1_28
#undef DMA0_TRIG015_PIO1_29
#undef DMA0_TRIG015_PIO1_30
#undef DMA0_TRIG015_PIO1_31
#undef DMA0_TRIG015_PIO1_6
#undef DMA0_TRIG015_PIO1_7
#undef DMA0_TRIG015_PIO1_8
#undef DMA0_TRIG015_PIO1_9
#undef DMA0_TRIG016_PIO0_0
#undef DMA0_TRIG016_PIO0_1
#undef DMA0_TRIG016_PIO0_17
#undef DMA0_TRIG016_PIO0_18
#undef DMA0_TRIG016_PIO0_19
#undef DMA0_TRIG016_PIO0_24
#undef DMA0_TRIG016_PIO0_28
#undef DMA0_TRIG016_PIO0_31
#undef DMA0_TRIG016_PIO0_7
#undef DMA0_TRIG016_PIO1_10
#undef DMA0_TRIG016_PIO1_11
#undef DMA0_TRIG016_PIO1_12
#undef DMA0_TRIG016_PIO1_13
#undef DMA0_TRIG016_PIO1_14
#undef DMA0_TRIG016_PIO1_15
#undef DMA0_TRIG016_PIO1_16
#undef DMA0_TRIG016_PIO1_17
#undef DMA0_TRIG016_PIO1_18
#undef DMA0_TRIG016_PIO1_19
#undef DMA0_TRIG016_PIO1_20
#undef DMA0_TRIG016_PIO1_22
#undef DMA0_TRIG016_PIO1_23
#undef DMA0_TRIG016_PIO1_24
#undef DMA0_TRIG016_PIO1_25
#undef DMA0_TRIG016_PIO1_26
#undef DMA0_TRIG016_PIO1_27
#undef DMA0_TRIG016_PIO1_28
#undef DMA0_TRIG016_PIO1_29
#undef DMA0_TRIG016_PIO1_30
#undef DMA0_TRIG016_PIO1_31
#undef DMA0_TRIG016_PIO1_6
#undef DMA0_TRIG016_PIO1_7
#undef DMA0_TRIG016_PIO1_8
#undef DMA0_TRIG016_PIO1_9
#undef DMA0_TRIG017_PIO0_0
#undef DMA0_TRIG017_PIO0_1
#undef DMA0_TRIG017_PIO0_17
#undef DMA0_TRIG017_PIO0_18
#undef DMA0_TRIG017_PIO0_19
#undef DMA0_TRIG017_PIO0_24
#undef DMA0_TRIG017_PIO0_28
#undef DMA0_TRIG017_PIO0_31
#undef DMA0_TRIG017_PIO0_7
#undef DMA0_TRIG017_PIO1_10
#undef DMA0_TRIG017_PIO1_11
#undef DMA0_TRIG017_PIO1_12
#undef DMA0_TRIG017_PIO1_13
#undef DMA0_TRIG017_PIO1_14
#undef DMA0_TRIG017_PIO1_15
#undef DMA0_TRIG017_PIO1_16
#undef DMA0_TRIG017_PIO1_17
#undef DMA0_TRIG017_PIO1_18
#undef DMA0_TRIG017_PIO1_19
#undef DMA0_TRIG017_PIO1_20
#undef DMA0_TRIG017_PIO1_22
#undef DMA0_TRIG017_PIO1_23
#undef DMA0_TRIG017_PIO1_24
#undef DMA0_TRIG017_PIO1_25
#undef DMA0_TRIG017_PIO1_26
#undef DMA0_TRIG017_PIO1_27
#undef DMA0_TRIG017_PIO1_28
#undef DMA0_TRIG017_PIO1_29
#undef DMA0_TRIG017_PIO1_30
#undef DMA0_TRIG017_PIO1_31
#undef DMA0_TRIG017_PIO1_6
#undef DMA0_TRIG017_PIO1_7
#undef DMA0_TRIG017_PIO1_8
#undef DMA0_TRIG017_PIO1_9
#undef DMA0_TRIG018_PIO0_0
#undef DMA0_TRIG018_PIO0_1
#undef DMA0_TRIG018_PIO0_17
#undef DMA0_TRIG018_PIO0_18
#undef DMA0_TRIG018_PIO0_19
#undef DMA0_TRIG018_PIO0_24
#undef DMA0_TRIG018_PIO0_28
#undef DMA0_TRIG018_PIO0_31
#undef DMA0_TRIG018_PIO0_7
#undef DMA0_TRIG018_PIO1_10
#undef DMA0_TRIG018_PIO1_11
#undef DMA0_TRIG018_PIO1_12
#undef DMA0_TRIG018_PIO1_13
#undef DMA0_TRIG018_PIO1_14
#undef DMA0_TRIG018_PIO1_15
#undef DMA0_TRIG018_PIO1_16
#undef DMA0_TRIG018_PIO1_17
#undef DMA0_TRIG018_PIO1_18
#undef DMA0_TRIG018_PIO1_19
#undef DMA0_TRIG018_PIO1_20
#undef DMA0_TRIG018_PIO1_22
#undef DMA0_TRIG018_PIO1_23
#undef DMA0_TRIG018_PIO1_24
#undef DMA0_TRIG018_PIO1_25
#undef DMA0_TRIG018_PIO1_26
#undef DMA0_TRIG018_PIO1_27
#undef DMA0_TRIG018_PIO1_28
#undef DMA0_TRIG018_PIO1_29
#undef DMA0_TRIG018_PIO1_30
#undef DMA0_TRIG018_PIO1_31
#undef DMA0_TRIG018_PIO1_6
#undef DMA0_TRIG018_PIO1_7
#undef DMA0_TRIG018_PIO1_8
#undef DMA0_TRIG018_PIO1_9
#undef DMA0_TRIG019_PIO0_0
#undef DMA0_TRIG019_PIO0_1
#undef DMA0_TRIG019_PIO0_17
#undef DMA0_TRIG019_PIO0_18
#undef DMA0_TRIG019_PIO0_19
#undef DMA0_TRIG019_PIO0_24
#undef DMA0_TRIG019_PIO0_28
#undef DMA0_TRIG019_PIO0_31
#undef DMA0_TRIG019_PIO0_7
#undef DMA0_TRIG019_PIO1_10
#undef DMA0_TRIG019_PIO1_11
#undef DMA0_TRIG019_PIO1_12
#undef DMA0_TRIG019_PIO1_13
#undef DMA0_TRIG019_PIO1_14
#undef DMA0_TRIG019_PIO1_15
#undef DMA0_TRIG019_PIO1_16
#undef DMA0_TRIG019_PIO1_17
#undef DMA0_TRIG019_PIO1_18
#undef DMA0_TRIG019_PIO1_19
#undef DMA0_TRIG019_PIO1_20
#undef DMA0_TRIG019_PIO1_22
#undef DMA0_TRIG019_PIO1_23
#undef DMA0_TRIG019_PIO1_24
#undef DMA0_TRIG019_PIO1_25
#undef DMA0_TRIG019_PIO1_26
#undef DMA0_TRIG019_PIO1_27
#undef DMA0_TRIG019_PIO1_28
#undef DMA0_TRIG019_PIO1_29
#undef DMA0_TRIG019_PIO1_30
#undef DMA0_TRIG019_PIO1_31
#undef DMA0_TRIG019_PIO1_6
#undef DMA0_TRIG019_PIO1_7
#undef DMA0_TRIG019_PIO1_8
#undef DMA0_TRIG019_PIO1_9
#undef DMA0_TRIG01_PIO0_0
#undef DMA0_TRIG01_PIO0_1
#undef DMA0_TRIG01_PIO0_17
#undef DMA0_TRIG01_PIO0_18
#undef DMA0_TRIG01_PIO0_19
#undef DMA0_TRIG01_PIO0_24
#undef DMA0_TRIG01_PIO0_28
#undef DMA0_TRIG01_PIO0_31
#undef DMA0_TRIG01_PIO0_7
#undef DMA0_TRIG01_PIO1_10
#undef DMA0_TRIG01_PIO1_11
#undef DMA0_TRIG01_PIO1_12
#undef DMA0_TRIG01_PIO1_13
#undef DMA0_TRIG01_PIO1_14
#undef DMA0_TRIG01_PIO1_15
#undef DMA0_TRIG01_PIO1_16
#undef DMA0_TRIG01_PIO1_17
#undef DMA0_TRIG01_PIO1_18
#undef DMA0_TRIG01_PIO1_19
#undef DMA0_TRIG01_PIO1_20
#undef DMA0_TRIG01_PIO1_22
#undef DMA0_TRIG01_PIO1_23
#undef DMA0_TRIG01_PIO1_24
#undef DMA0_TRIG01_PIO1_25
#undef DMA0_TRIG01_PIO1_26
#undef DMA0_TRIG01_PIO1_27
#undef DMA0_TRIG01_PIO1_28
#undef DMA0_TRIG01_PIO1_29
#undef DMA0_TRIG01_PIO1_30
#undef DMA0_TRIG01_PIO1_31
#undef DMA0_TRIG01_PIO1_6
#undef DMA0_TRIG01_PIO1_7
#undef DMA0_TRIG01_PIO1_8
#undef DMA0_TRIG01_PIO1_9
#undef DMA0_TRIG020_PIO0_0
#undef DMA0_TRIG020_PIO0_1
#undef DMA0_TRIG020_PIO0_17
#undef DMA0_TRIG020_PIO0_18
#undef DMA0_TRIG020_PIO0_19
#undef DMA0_TRIG020_PIO0_24
#undef DMA0_TRIG020_PIO0_28
#undef DMA0_TRIG020_PIO0_31
#undef DMA0_TRIG020_PIO0_7
#undef DMA0_TRIG020_PIO1_10
#undef DMA0_TRIG020_PIO1_11
#undef DMA0_TRIG020_PIO1_12
#undef DMA0_TRIG020_PIO1_13
#undef DMA0_TRIG020_PIO1_14
#undef DMA0_TRIG020_PIO1_15
#undef DMA0_TRIG020_PIO1_16
#undef DMA0_TRIG020_PIO1_17
#undef DMA0_TRIG020_PIO1_18
#undef DMA0_TRIG020_PIO1_19
#undef DMA0_TRIG020_PIO1_20
#undef DMA0_TRIG020_PIO1_22
#undef DMA0_TRIG020_PIO1_23
#undef DMA0_TRIG020_PIO1_24
#undef DMA0_TRIG020_PIO1_25
#undef DMA0_TRIG020_PIO1_26
#undef DMA0_TRIG020_PIO1_27
#undef DMA0_TRIG020_PIO1_28
#undef DMA0_TRIG020_PIO1_29
#undef DMA0_TRIG020_PIO1_30
#undef DMA0_TRIG020_PIO1_31
#undef DMA0_TRIG020_PIO1_6
#undef DMA0_TRIG020_PIO1_7
#undef DMA0_TRIG020_PIO1_8
#undef DMA0_TRIG020_PIO1_9
#undef DMA0_TRIG021_PIO0_0
#undef DMA0_TRIG021_PIO0_1
#undef DMA0_TRIG021_PIO0_17
#undef DMA0_TRIG021_PIO0_18
#undef DMA0_TRIG021_PIO0_19
#undef DMA0_TRIG021_PIO0_24
#undef DMA0_TRIG021_PIO0_28
#undef DMA0_TRIG021_PIO0_31
#undef DMA0_TRIG021_PIO0_7
#undef DMA0_TRIG021_PIO1_10
#undef DMA0_TRIG021_PIO1_11
#undef DMA0_TRIG021_PIO1_12
#undef DMA0_TRIG021_PIO1_13
#undef DMA0_TRIG021_PIO1_14
#undef DMA0_TRIG021_PIO1_15
#undef DMA0_TRIG021_PIO1_16
#undef DMA0_TRIG021_PIO1_17
#undef DMA0_TRIG021_PIO1_18
#undef DMA0_TRIG021_PIO1_19
#undef DMA0_TRIG021_PIO1_20
#undef DMA0_TRIG021_PIO1_22
#undef DMA0_TRIG021_PIO1_23
#undef DMA0_TRIG021_PIO1_24
#undef DMA0_TRIG021_PIO1_25
#undef DMA0_TRIG021_PIO1_26
#undef DMA0_TRIG021_PIO1_27
#undef DMA0_TRIG021_PIO1_28
#undef DMA0_TRIG021_PIO1_29
#undef DMA0_TRIG021_PIO1_30
#undef DMA0_TRIG021_PIO1_31
#undef DMA0_TRIG021_PIO1_6
#undef DMA0_TRIG021_PIO1_7
#undef DMA0_TRIG021_PIO1_8
#undef DMA0_TRIG021_PIO1_9
#undef DMA0_TRIG022_PIO0_0
#undef DMA0_TRIG022_PIO0_1
#undef DMA0_TRIG022_PIO0_17
#undef DMA0_TRIG022_PIO0_18
#undef DMA0_TRIG022_PIO0_19
#undef DMA0_TRIG022_PIO0_24
#undef DMA0_TRIG022_PIO0_28
#undef DMA0_TRIG022_PIO0_31
#undef DMA0_TRIG022_PIO0_7
#undef DMA0_TRIG022_PIO1_10
#undef DMA0_TRIG022_PIO1_11
#undef DMA0_TRIG022_PIO1_12
#undef DMA0_TRIG022_PIO1_13
#undef DMA0_TRIG022_PIO1_14
#undef DMA0_TRIG022_PIO1_15
#undef DMA0_TRIG022_PIO1_16
#undef DMA0_TRIG022_PIO1_17
#undef DMA0_TRIG022_PIO1_18
#undef DMA0_TRIG022_PIO1_19
#undef DMA0_TRIG022_PIO1_20
#undef DMA0_TRIG022_PIO1_22
#undef DMA0_TRIG022_PIO1_23
#undef DMA0_TRIG022_PIO1_24
#undef DMA0_TRIG022_PIO1_25
#undef DMA0_TRIG022_PIO1_26
#undef DMA0_TRIG022_PIO1_27
#undef DMA0_TRIG022_PIO1_28
#undef DMA0_TRIG022_PIO1_29
#undef DMA0_TRIG022_PIO1_30
#undef DMA0_TRIG022_PIO1_31
#undef DMA0_TRIG022_PIO1_6
#undef DMA0_TRIG022_PIO1_7
#undef DMA0_TRIG022_PIO1_8
#undef DMA0_TRIG022_PIO1_9
#undef DMA0_TRIG02_PIO0_0
#undef DMA0_TRIG02_PIO0_1
#undef DMA0_TRIG02_PIO0_17
#undef DMA0_TRIG02_PIO0_18
#undef DMA0_TRIG02_PIO0_19
#undef DMA0_TRIG02_PIO0_24
#undef DMA0_TRIG02_PIO0_28
#undef DMA0_TRIG02_PIO0_31
#undef DMA0_TRIG02_PIO0_7
#undef DMA0_TRIG02_PIO1_10
#undef DMA0_TRIG02_PIO1_11
#undef DMA0_TRIG02_PIO1_12
#undef DMA0_TRIG02_PIO1_13
#undef DMA0_TRIG02_PIO1_14
#undef DMA0_TRIG02_PIO1_15
#undef DMA0_TRIG02_PIO1_16
#undef DMA0_TRIG02_PIO1_17
#undef DMA0_TRIG02_PIO1_18
#undef DMA0_TRIG02_PIO1_19
#undef DMA0_TRIG02_PIO1_20
#undef DMA0_TRIG02_PIO1_22
#undef DMA0_TRIG02_PIO1_23
#undef DMA0_TRIG02_PIO1_24
#undef DMA0_TRIG02_PIO1_25
#undef DMA0_TRIG02_PIO1_26
#undef DMA0_TRIG02_PIO1_27
#undef DMA0_TRIG02_PIO1_28
#undef DMA0_TRIG02_PIO1_29
#undef DMA0_TRIG02_PIO1_30
#undef DMA0_TRIG02_PIO1_31
#undef DMA0_TRIG02_PIO1_6
#undef DMA0_TRIG02_PIO1_7
#undef DMA0_TRIG02_PIO1_8
#undef DMA0_TRIG02_PIO1_9
#undef DMA0_TRIG03_PIO0_0
#undef DMA0_TRIG03_PIO0_1
#undef DMA0_TRIG03_PIO0_17
#undef DMA0_TRIG03_PIO0_18
#undef DMA0_TRIG03_PIO0_19
#undef DMA0_TRIG03_PIO0_24
#undef DMA0_TRIG03_PIO0_28
#undef DMA0_TRIG03_PIO0_31
#undef DMA0_TRIG03_PIO0_7
#undef DMA0_TRIG03_PIO1_10
#undef DMA0_TRIG03_PIO1_11
#undef DMA0_TRIG03_PIO1_12
#undef DMA0_TRIG03_PIO1_13
#undef DMA0_TRIG03_PIO1_14
#undef DMA0_TRIG03_PIO1_15
#undef DMA0_TRIG03_PIO1_16
#undef DMA0_TRIG03_PIO1_17
#undef DMA0_TRIG03_PIO1_18
#undef DMA0_TRIG03_PIO1_19
#undef DMA0_TRIG03_PIO1_20
#undef DMA0_TRIG03_PIO1_22
#undef DMA0_TRIG03_PIO1_23
#undef DMA0_TRIG03_PIO1_24
#undef DMA0_TRIG03_PIO1_25
#undef DMA0_TRIG03_PIO1_26
#undef DMA0_TRIG03_PIO1_27
#undef DMA0_TRIG03_PIO1_28
#undef DMA0_TRIG03_PIO1_29
#undef DMA0_TRIG03_PIO1_30
#undef DMA0_TRIG03_PIO1_31
#undef DMA0_TRIG03_PIO1_6
#undef DMA0_TRIG03_PIO1_7
#undef DMA0_TRIG03_PIO1_8
#undef DMA0_TRIG03_PIO1_9
#undef DMA0_TRIG04_PIO0_0
#undef DMA0_TRIG04_PIO0_1
#undef DMA0_TRIG04_PIO0_17
#undef DMA0_TRIG04_PIO0_18
#undef DMA0_TRIG04_PIO0_19
#undef DMA0_TRIG04_PIO0_24
#undef DMA0_TRIG04_PIO0_28
#undef DMA0_TRIG04_PIO0_31
#undef DMA0_TRIG04_PIO0_7
#undef DMA0_TRIG04_PIO1_10
#undef DMA0_TRIG04_PIO1_11
#undef DMA0_TRIG04_PIO1_12
#undef DMA0_TRIG04_PIO1_13
#undef DMA0_TRIG04_PIO1_14
#undef DMA0_TRIG04_PIO1_15
#undef DMA0_TRIG04_PIO1_16
#undef DMA0_TRIG04_PIO1_17
#undef DMA0_TRIG04_PIO1_18
#undef DMA0_TRIG04_PIO1_19
#undef DMA0_TRIG04_PIO1_20
