zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc55xxx/pinctrl/LPC5506JHI48-pinctrl.h
#undef DMA0_TRIG04_PIO1_22
#undef DMA0_TRIG04_PIO1_23
#undef DMA0_TRIG04_PIO1_24
#undef DMA0_TRIG04_PIO1_25
#undef DMA0_TRIG04_PIO1_26
#undef DMA0_TRIG04_PIO1_27
#undef DMA0_TRIG04_PIO1_28
#undef DMA0_TRIG04_PIO1_29
#undef DMA0_TRIG04_PIO1_30
#undef DMA0_TRIG04_PIO1_31
#undef DMA0_TRIG04_PIO1_6
#undef DMA0_TRIG04_PIO1_7
#undef DMA0_TRIG04_PIO1_8
#undef DMA0_TRIG04_PIO1_9
#undef DMA0_TRIG05_PIO0_0
#undef DMA0_TRIG05_PIO0_1
#undef DMA0_TRIG05_PIO0_17
#undef DMA0_TRIG05_PIO0_18
#undef DMA0_TRIG05_PIO0_19
#undef DMA0_TRIG05_PIO0_24
#undef DMA0_TRIG05_PIO0_28
#undef DMA0_TRIG05_PIO0_31
#undef DMA0_TRIG05_PIO0_7
#undef DMA0_TRIG05_PIO1_10
#undef DMA0_TRIG05_PIO1_11
#undef DMA0_TRIG05_PIO1_12
#undef DMA0_TRIG05_PIO1_13
#undef DMA0_TRIG05_PIO1_14
#undef DMA0_TRIG05_PIO1_15
#undef DMA0_TRIG05_PIO1_16
#undef DMA0_TRIG05_PIO1_17
#undef DMA0_TRIG05_PIO1_18
#undef DMA0_TRIG05_PIO1_19
#undef DMA0_TRIG05_PIO1_20
#undef DMA0_TRIG05_PIO1_22
#undef DMA0_TRIG05_PIO1_23
#undef DMA0_TRIG05_PIO1_24
#undef DMA0_TRIG05_PIO1_25
#undef DMA0_TRIG05_PIO1_26
#undef DMA0_TRIG05_PIO1_27
#undef DMA0_TRIG05_PIO1_28
#undef DMA0_TRIG05_PIO1_29
#undef DMA0_TRIG05_PIO1_30
#undef DMA0_TRIG05_PIO1_31
#undef DMA0_TRIG05_PIO1_6
#undef DMA0_TRIG05_PIO1_7
#undef DMA0_TRIG05_PIO1_8
#undef DMA0_TRIG05_PIO1_9
#undef DMA0_TRIG06_PIO0_0
#undef DMA0_TRIG06_PIO0_1
#undef DMA0_TRIG06_PIO0_17
#undef DMA0_TRIG06_PIO0_18
#undef DMA0_TRIG06_PIO0_19
#undef DMA0_TRIG06_PIO0_24
#undef DMA0_TRIG06_PIO0_28
#undef DMA0_TRIG06_PIO0_31
#undef DMA0_TRIG06_PIO0_7
#undef DMA0_TRIG06_PIO1_10
#undef DMA0_TRIG06_PIO1_11
#undef DMA0_TRIG06_PIO1_12
#undef DMA0_TRIG06_PIO1_13
#undef DMA0_TRIG06_PIO1_14
#undef DMA0_TRIG06_PIO1_15
#undef DMA0_TRIG06_PIO1_16
#undef DMA0_TRIG06_PIO1_17
#undef DMA0_TRIG06_PIO1_18
#undef DMA0_TRIG06_PIO1_19
#undef DMA0_TRIG06_PIO1_20
#undef DMA0_TRIG06_PIO1_22
#undef DMA0_TRIG06_PIO1_23
#undef DMA0_TRIG06_PIO1_24
#undef DMA0_TRIG06_PIO1_25
#undef DMA0_TRIG06_PIO1_26
#undef DMA0_TRIG06_PIO1_27
#undef DMA0_TRIG06_PIO1_28
#undef DMA0_TRIG06_PIO1_29
#undef DMA0_TRIG06_PIO1_30
#undef DMA0_TRIG06_PIO1_31
#undef DMA0_TRIG06_PIO1_6
#undef DMA0_TRIG06_PIO1_7
#undef DMA0_TRIG06_PIO1_8
#undef DMA0_TRIG06_PIO1_9
#undef DMA0_TRIG07_PIO0_0
#undef DMA0_TRIG07_PIO0_1
#undef DMA0_TRIG07_PIO0_17
#undef DMA0_TRIG07_PIO0_18
#undef DMA0_TRIG07_PIO0_19
#undef DMA0_TRIG07_PIO0_24
#undef DMA0_TRIG07_PIO0_28
#undef DMA0_TRIG07_PIO0_31
#undef DMA0_TRIG07_PIO0_7
#undef DMA0_TRIG07_PIO1_10
#undef DMA0_TRIG07_PIO1_11
#undef DMA0_TRIG07_PIO1_12
#undef DMA0_TRIG07_PIO1_13
#undef DMA0_TRIG07_PIO1_14
#undef DMA0_TRIG07_PIO1_15
#undef DMA0_TRIG07_PIO1_16
#undef DMA0_TRIG07_PIO1_17
#undef DMA0_TRIG07_PIO1_18
#undef DMA0_TRIG07_PIO1_19
#undef DMA0_TRIG07_PIO1_20
#undef DMA0_TRIG07_PIO1_22
#undef DMA0_TRIG07_PIO1_23
#undef DMA0_TRIG07_PIO1_24
#undef DMA0_TRIG07_PIO1_25
#undef DMA0_TRIG07_PIO1_26
#undef DMA0_TRIG07_PIO1_27
#undef DMA0_TRIG07_PIO1_28
#undef DMA0_TRIG07_PIO1_29
#undef DMA0_TRIG07_PIO1_30
#undef DMA0_TRIG07_PIO1_31
#undef DMA0_TRIG07_PIO1_6
#undef DMA0_TRIG07_PIO1_7
#undef DMA0_TRIG07_PIO1_8
#undef DMA0_TRIG07_PIO1_9
#undef DMA0_TRIG08_PIO0_0
#undef DMA0_TRIG08_PIO0_1
#undef DMA0_TRIG08_PIO0_17
#undef DMA0_TRIG08_PIO0_18
#undef DMA0_TRIG08_PIO0_19
#undef DMA0_TRIG08_PIO0_24
#undef DMA0_TRIG08_PIO0_28
#undef DMA0_TRIG08_PIO0_31
#undef DMA0_TRIG08_PIO0_7
#undef DMA0_TRIG08_PIO1_10
#undef DMA0_TRIG08_PIO1_11
#undef DMA0_TRIG08_PIO1_12
#undef DMA0_TRIG08_PIO1_13
#undef DMA0_TRIG08_PIO1_14
#undef DMA0_TRIG08_PIO1_15
#undef DMA0_TRIG08_PIO1_16
#undef DMA0_TRIG08_PIO1_17
#undef DMA0_TRIG08_PIO1_18
#undef DMA0_TRIG08_PIO1_19
#undef DMA0_TRIG08_PIO1_20
#undef DMA0_TRIG08_PIO1_22
#undef DMA0_TRIG08_PIO1_23
#undef DMA0_TRIG08_PIO1_24
#undef DMA0_TRIG08_PIO1_25
#undef DMA0_TRIG08_PIO1_26
#undef DMA0_TRIG08_PIO1_27
#undef DMA0_TRIG08_PIO1_28
#undef DMA0_TRIG08_PIO1_29
#undef DMA0_TRIG08_PIO1_30
#undef DMA0_TRIG08_PIO1_31
#undef DMA0_TRIG08_PIO1_6
#undef DMA0_TRIG08_PIO1_7
#undef DMA0_TRIG08_PIO1_8
#undef DMA0_TRIG08_PIO1_9
#undef DMA0_TRIG09_PIO0_0
#undef DMA0_TRIG09_PIO0_1
#undef DMA0_TRIG09_PIO0_17
#undef DMA0_TRIG09_PIO0_18
#undef DMA0_TRIG09_PIO0_19
#undef DMA0_TRIG09_PIO0_24
#undef DMA0_TRIG09_PIO0_28
#undef DMA0_TRIG09_PIO0_31
#undef DMA0_TRIG09_PIO0_7
#undef DMA0_TRIG09_PIO1_10
#undef DMA0_TRIG09_PIO1_11
#undef DMA0_TRIG09_PIO1_12
#undef DMA0_TRIG09_PIO1_13
#undef DMA0_TRIG09_PIO1_14
#undef DMA0_TRIG09_PIO1_15
#undef DMA0_TRIG09_PIO1_16
#undef DMA0_TRIG09_PIO1_17
#undef DMA0_TRIG09_PIO1_18
#undef DMA0_TRIG09_PIO1_19
#undef DMA0_TRIG09_PIO1_20
#undef DMA0_TRIG09_PIO1_22
#undef DMA0_TRIG09_PIO1_23
#undef DMA0_TRIG09_PIO1_24
#undef DMA0_TRIG09_PIO1_25
#undef DMA0_TRIG09_PIO1_26
#undef DMA0_TRIG09_PIO1_27
#undef DMA0_TRIG09_PIO1_28
#undef DMA0_TRIG09_PIO1_29
#undef DMA0_TRIG09_PIO1_30
#undef DMA0_TRIG09_PIO1_31
#undef DMA0_TRIG09_PIO1_6
#undef DMA0_TRIG09_PIO1_7
#undef DMA0_TRIG09_PIO1_8
#undef DMA0_TRIG09_PIO1_9
#undef DMA1_TRIG10_PIO0_0
#undef DMA1_TRIG10_PIO0_1
#undef DMA1_TRIG10_PIO0_17
#undef DMA1_TRIG10_PIO0_18
#undef DMA1_TRIG10_PIO0_19
#undef DMA1_TRIG10_PIO0_24
#undef DMA1_TRIG10_PIO0_28
#undef DMA1_TRIG10_PIO0_31
#undef DMA1_TRIG10_PIO0_7
#undef DMA1_TRIG10_PIO1_10
#undef DMA1_TRIG10_PIO1_11
#undef DMA1_TRIG10_PIO1_12
#undef DMA1_TRIG10_PIO1_13
#undef DMA1_TRIG10_PIO1_14
#undef DMA1_TRIG10_PIO1_15
#undef DMA1_TRIG10_PIO1_16
#undef DMA1_TRIG10_PIO1_17
#undef DMA1_TRIG10_PIO1_18
#undef DMA1_TRIG10_PIO1_19
#undef DMA1_TRIG10_PIO1_20
#undef DMA1_TRIG10_PIO1_22
#undef DMA1_TRIG10_PIO1_23
#undef DMA1_TRIG10_PIO1_24
#undef DMA1_TRIG10_PIO1_25
#undef DMA1_TRIG10_PIO1_26
#undef DMA1_TRIG10_PIO1_27
#undef DMA1_TRIG10_PIO1_28
#undef DMA1_TRIG10_PIO1_29
#undef DMA1_TRIG10_PIO1_30
#undef DMA1_TRIG10_PIO1_31
#undef DMA1_TRIG10_PIO1_6
#undef DMA1_TRIG10_PIO1_7
#undef DMA1_TRIG10_PIO1_8
#undef DMA1_TRIG10_PIO1_9
#undef DMA1_TRIG11_PIO0_0
#undef DMA1_TRIG11_PIO0_1
#undef DMA1_TRIG11_PIO0_17
#undef DMA1_TRIG11_PIO0_18
#undef DMA1_TRIG11_PIO0_19
#undef DMA1_TRIG11_PIO0_24
#undef DMA1_TRIG11_PIO0_28
#undef DMA1_TRIG11_PIO0_31
#undef DMA1_TRIG11_PIO0_7
#undef DMA1_TRIG11_PIO1_10
#undef DMA1_TRIG11_PIO1_11
#undef DMA1_TRIG11_PIO1_12
#undef DMA1_TRIG11_PIO1_13
#undef DMA1_TRIG11_PIO1_14
#undef DMA1_TRIG11_PIO1_15
#undef DMA1_TRIG11_PIO1_16
#undef DMA1_TRIG11_PIO1_17
#undef DMA1_TRIG11_PIO1_18
#undef DMA1_TRIG11_PIO1_19
#undef DMA1_TRIG11_PIO1_20
#undef DMA1_TRIG11_PIO1_22
#undef DMA1_TRIG11_PIO1_23
#undef DMA1_TRIG11_PIO1_24
#undef DMA1_TRIG11_PIO1_25
#undef DMA1_TRIG11_PIO1_26
#undef DMA1_TRIG11_PIO1_27
#undef DMA1_TRIG11_PIO1_28
#undef DMA1_TRIG11_PIO1_29
#undef DMA1_TRIG11_PIO1_30
#undef DMA1_TRIG11_PIO1_31
#undef DMA1_TRIG11_PIO1_6
#undef DMA1_TRIG11_PIO1_7
#undef DMA1_TRIG11_PIO1_8
#undef DMA1_TRIG11_PIO1_9
#undef DMA1_TRIG12_PIO0_0
#undef DMA1_TRIG12_PIO0_1
#undef DMA1_TRIG12_PIO0_17
#undef DMA1_TRIG12_PIO0_18
#undef DMA1_TRIG12_PIO0_19
#undef DMA1_TRIG12_PIO0_24
#undef DMA1_TRIG12_PIO0_28
#undef DMA1_TRIG12_PIO0_31
#undef DMA1_TRIG12_PIO0_7
#undef DMA1_TRIG12_PIO1_10
#undef DMA1_TRIG12_PIO1_11
#undef DMA1_TRIG12_PIO1_12
#undef DMA1_TRIG12_PIO1_13
#undef DMA1_TRIG12_PIO1_14
#undef DMA1_TRIG12_PIO1_15
#undef DMA1_TRIG12_PIO1_16
#undef DMA1_TRIG12_PIO1_17
#undef DMA1_TRIG12_PIO1_18
#undef DMA1_TRIG12_PIO1_19
#undef DMA1_TRIG12_PIO1_20
#undef DMA1_TRIG12_PIO1_22
#undef DMA1_TRIG12_PIO1_23
#undef DMA1_TRIG12_PIO1_24
#undef DMA1_TRIG12_PIO1_25
#undef DMA1_TRIG12_PIO1_26
#undef DMA1_TRIG12_PIO1_27
#undef DMA1_TRIG12_PIO1_28
#undef DMA1_TRIG12_PIO1_29
#undef DMA1_TRIG12_PIO1_30
#undef DMA1_TRIG12_PIO1_31
#undef DMA1_TRIG12_PIO1_6
#undef DMA1_TRIG12_PIO1_7
#undef DMA1_TRIG12_PIO1_8
#undef DMA1_TRIG12_PIO1_9
#undef DMA1_TRIG13_PIO0_0
#undef DMA1_TRIG13_PIO0_1
#undef DMA1_TRIG13_PIO0_17
#undef DMA1_TRIG13_PIO0_18
#undef DMA1_TRIG13_PIO0_19
#undef DMA1_TRIG13_PIO0_24
#undef DMA1_TRIG13_PIO0_28
#undef DMA1_TRIG13_PIO0_31
#undef DMA1_TRIG13_PIO0_7
#undef DMA1_TRIG13_PIO1_10
#undef DMA1_TRIG13_PIO1_11
#undef DMA1_TRIG13_PIO1_12
#undef DMA1_TRIG13_PIO1_13
#undef DMA1_TRIG13_PIO1_14
#undef DMA1_TRIG13_PIO1_15
#undef DMA1_TRIG13_PIO1_16
#undef DMA1_TRIG13_PIO1_17
#undef DMA1_TRIG13_PIO1_18
#undef DMA1_TRIG13_PIO1_19
#undef DMA1_TRIG13_PIO1_20
#undef DMA1_TRIG13_PIO1_22
#undef DMA1_TRIG13_PIO1_23
#undef DMA1_TRIG13_PIO1_24
#undef DMA1_TRIG13_PIO1_25
#undef DMA1_TRIG13_PIO1_26
#undef DMA1_TRIG13_PIO1_27
#undef DMA1_TRIG13_PIO1_28
#undef DMA1_TRIG13_PIO1_29
#undef DMA1_TRIG13_PIO1_30
#undef DMA1_TRIG13_PIO1_31
#undef DMA1_TRIG13_PIO1_6
#undef DMA1_TRIG13_PIO1_7
#undef DMA1_TRIG13_PIO1_8
#undef DMA1_TRIG13_PIO1_9
#undef DMA1_TRIG14_PIO0_0
#undef DMA1_TRIG14_PIO0_1
#undef DMA1_TRIG14_PIO0_17
#undef DMA1_TRIG14_PIO0_18
#undef DMA1_TRIG14_PIO0_19
#undef DMA1_TRIG14_PIO0_24
#undef DMA1_TRIG14_PIO0_28
#undef DMA1_TRIG14_PIO0_31
#undef DMA1_TRIG14_PIO0_7
#undef DMA1_TRIG14_PIO1_10
#undef DMA1_TRIG14_PIO1_11
#undef DMA1_TRIG14_PIO1_12
#undef DMA1_TRIG14_PIO1_13
#undef DMA1_TRIG14_PIO1_14
#undef DMA1_TRIG14_PIO1_15
#undef DMA1_TRIG14_PIO1_16
#undef DMA1_TRIG14_PIO1_17
#undef DMA1_TRIG14_PIO1_18
#undef DMA1_TRIG14_PIO1_19
#undef DMA1_TRIG14_PIO1_20
#undef DMA1_TRIG14_PIO1_22
#undef DMA1_TRIG14_PIO1_23
#undef DMA1_TRIG14_PIO1_24
#undef DMA1_TRIG14_PIO1_25
#undef DMA1_TRIG14_PIO1_26
#undef DMA1_TRIG14_PIO1_27
#undef DMA1_TRIG14_PIO1_28
#undef DMA1_TRIG14_PIO1_29
#undef DMA1_TRIG14_PIO1_30
#undef DMA1_TRIG14_PIO1_31
#undef DMA1_TRIG14_PIO1_6
#undef DMA1_TRIG14_PIO1_7
#undef DMA1_TRIG14_PIO1_8
#undef DMA1_TRIG14_PIO1_9
#undef DMA1_TRIG15_PIO0_0
#undef DMA1_TRIG15_PIO0_1
#undef DMA1_TRIG15_PIO0_17
#undef DMA1_TRIG15_PIO0_18
#undef DMA1_TRIG15_PIO0_19
#undef DMA1_TRIG15_PIO0_24
#undef DMA1_TRIG15_PIO0_28
#undef DMA1_TRIG15_PIO0_31
#undef DMA1_TRIG15_PIO0_7
#undef DMA1_TRIG15_PIO1_10
#undef DMA1_TRIG15_PIO1_11
#undef DMA1_TRIG15_PIO1_12
#undef DMA1_TRIG15_PIO1_13
#undef DMA1_TRIG15_PIO1_14
#undef DMA1_TRIG15_PIO1_15
#undef DMA1_TRIG15_PIO1_16
#undef DMA1_TRIG15_PIO1_17
#undef DMA1_TRIG15_PIO1_18
#undef DMA1_TRIG15_PIO1_19
#undef DMA1_TRIG15_PIO1_20
#undef DMA1_TRIG15_PIO1_22
#undef DMA1_TRIG15_PIO1_23
#undef DMA1_TRIG15_PIO1_24
#undef DMA1_TRIG15_PIO1_25
#undef DMA1_TRIG15_PIO1_26
#undef DMA1_TRIG15_PIO1_27
#undef DMA1_TRIG15_PIO1_28
#undef DMA1_TRIG15_PIO1_29
#undef DMA1_TRIG15_PIO1_30
#undef DMA1_TRIG15_PIO1_31
#undef DMA1_TRIG15_PIO1_6
#undef DMA1_TRIG15_PIO1_7
#undef DMA1_TRIG15_PIO1_8
#undef DMA1_TRIG15_PIO1_9
#undef DMA1_TRIG16_PIO0_0
#undef DMA1_TRIG16_PIO0_1
#undef DMA1_TRIG16_PIO0_17
#undef DMA1_TRIG16_PIO0_18
#undef DMA1_TRIG16_PIO0_19
#undef DMA1_TRIG16_PIO0_24
#undef DMA1_TRIG16_PIO0_28
#undef DMA1_TRIG16_PIO0_31
#undef DMA1_TRIG16_PIO0_7
#undef DMA1_TRIG16_PIO1_10
#undef DMA1_TRIG16_PIO1_11
#undef DMA1_TRIG16_PIO1_12
#undef DMA1_TRIG16_PIO1_13
#undef DMA1_TRIG16_PIO1_14
#undef DMA1_TRIG16_PIO1_15
#undef DMA1_TRIG16_PIO1_16
#undef DMA1_TRIG16_PIO1_17
#undef DMA1_TRIG16_PIO1_18
#undef DMA1_TRIG16_PIO1_19
#undef DMA1_TRIG16_PIO1_20
#undef DMA1_TRIG16_PIO1_22
#undef DMA1_TRIG16_PIO1_23
#undef DMA1_TRIG16_PIO1_24
#undef DMA1_TRIG16_PIO1_25
#undef DMA1_TRIG16_PIO1_26
#undef DMA1_TRIG16_PIO1_27
#undef DMA1_TRIG16_PIO1_28
#undef DMA1_TRIG16_PIO1_29
#undef DMA1_TRIG16_PIO1_30
#undef DMA1_TRIG16_PIO1_31
#undef DMA1_TRIG16_PIO1_6
#undef DMA1_TRIG16_PIO1_7
#undef DMA1_TRIG16_PIO1_8
#undef DMA1_TRIG16_PIO1_9
#undef DMA1_TRIG17_PIO0_0
#undef DMA1_TRIG17_PIO0_1
#undef DMA1_TRIG17_PIO0_17
#undef DMA1_TRIG17_PIO0_18
#undef DMA1_TRIG17_PIO0_19
#undef DMA1_TRIG17_PIO0_24
#undef DMA1_TRIG17_PIO0_28
#undef DMA1_TRIG17_PIO0_31
#undef DMA1_TRIG17_PIO0_7
#undef DMA1_TRIG17_PIO1_10
#undef DMA1_TRIG17_PIO1_11
#undef DMA1_TRIG17_PIO1_12
#undef DMA1_TRIG17_PIO1_13
#undef DMA1_TRIG17_PIO1_14
#undef DMA1_TRIG17_PIO1_15
#undef DMA1_TRIG17_PIO1_16
#undef DMA1_TRIG17_PIO1_17
#undef DMA1_TRIG17_PIO1_18
#undef DMA1_TRIG17_PIO1_19
#undef DMA1_TRIG17_PIO1_20
#undef DMA1_TRIG17_PIO1_22
#undef DMA1_TRIG17_PIO1_23
#undef DMA1_TRIG17_PIO1_24
#undef DMA1_TRIG17_PIO1_25
#undef DMA1_TRIG17_PIO1_26
#undef DMA1_TRIG17_PIO1_27
#undef DMA1_TRIG17_PIO1_28
#undef DMA1_TRIG17_PIO1_29
#undef DMA1_TRIG17_PIO1_30
#undef DMA1_TRIG17_PIO1_31
#undef DMA1_TRIG17_PIO1_6
#undef DMA1_TRIG17_PIO1_7
#undef DMA1_TRIG17_PIO1_8
#undef DMA1_TRIG17_PIO1_9
#undef DMA1_TRIG18_PIO0_0
#undef DMA1_TRIG18_PIO0_1
#undef DMA1_TRIG18_PIO0_17
#undef DMA1_TRIG18_PIO0_18
#undef DMA1_TRIG18_PIO0_19
#undef DMA1_TRIG18_PIO0_24
#undef DMA1_TRIG18_PIO0_28
#undef DMA1_TRIG18_PIO0_31
#undef DMA1_TRIG18_PIO0_7
#undef DMA1_TRIG18_PIO1_10
#undef DMA1_TRIG18_PIO1_11
#undef DMA1_TRIG18_PIO1_12
#undef DMA1_TRIG18_PIO1_13
#undef DMA1_TRIG18_PIO1_14
#undef DMA1_TRIG18_PIO1_15
#undef DMA1_TRIG18_PIO1_16
#undef DMA1_TRIG18_PIO1_17
#undef DMA1_TRIG18_PIO1_18
#undef DMA1_TRIG18_PIO1_19
#undef DMA1_TRIG18_PIO1_20
#undef DMA1_TRIG18_PIO1_22
#undef DMA1_TRIG18_PIO1_23
#undef DMA1_TRIG18_PIO1_24
#undef DMA1_TRIG18_PIO1_25
#undef DMA1_TRIG18_PIO1_26
#undef DMA1_TRIG18_PIO1_27
#undef DMA1_TRIG18_PIO1_28
#undef DMA1_TRIG18_PIO1_29
#undef DMA1_TRIG18_PIO1_30
#undef DMA1_TRIG18_PIO1_31
#undef DMA1_TRIG18_PIO1_6
#undef DMA1_TRIG18_PIO1_7
#undef DMA1_TRIG18_PIO1_8
#undef DMA1_TRIG18_PIO1_9
#undef DMA1_TRIG19_PIO0_0
#undef DMA1_TRIG19_PIO0_1
#undef DMA1_TRIG19_PIO0_17
#undef DMA1_TRIG19_PIO0_18
#undef DMA1_TRIG19_PIO0_19
#undef DMA1_TRIG19_PIO0_24
#undef DMA1_TRIG19_PIO0_28
#undef DMA1_TRIG19_PIO0_31
#undef DMA1_TRIG19_PIO0_7
#undef DMA1_TRIG19_PIO1_10
#undef DMA1_TRIG19_PIO1_11
#undef DMA1_TRIG19_PIO1_12
#undef DMA1_TRIG19_PIO1_13
#undef DMA1_TRIG19_PIO1_14
#undef DMA1_TRIG19_PIO1_15
#undef DMA1_TRIG19_PIO1_16
#undef DMA1_TRIG19_PIO1_17
#undef DMA1_TRIG19_PIO1_18
#undef DMA1_TRIG19_PIO1_19
#undef DMA1_TRIG19_PIO1_20
#undef DMA1_TRIG19_PIO1_22
#undef DMA1_TRIG19_PIO1_23
#undef DMA1_TRIG19_PIO1_24
#undef DMA1_TRIG19_PIO1_25
#undef DMA1_TRIG19_PIO1_26
#undef DMA1_TRIG19_PIO1_27
#undef DMA1_TRIG19_PIO1_28
#undef DMA1_TRIG19_PIO1_29
#undef DMA1_TRIG19_PIO1_30
#undef DMA1_TRIG19_PIO1_31
#undef DMA1_TRIG19_PIO1_6
#undef DMA1_TRIG19_PIO1_7
#undef DMA1_TRIG19_PIO1_8
#undef DMA1_TRIG19_PIO1_9
#undef FC0_CTS_SDA_SSEL0_PIO0_31
#undef FC0_CTS_SDA_SSEL0_PIO1_8
#undef FC0_RTS_SCL_SSEL1_PIO1_7
#undef FC0_RXD_SDA_MOSI_DATA_PIO0_24
#undef FC0_SCK_PIO0_28
#undef FC0_TXD_SCL_MISO_WS_PIO1_6
#undef FC1_RXD_SDA_MOSI_DATA_PIO1_10
#undef FC1_SCK_PIO0_7
#undef FC1_SCK_PIO1_9
#undef FC1_TXD_SCL_MISO_WS_PIO1_11
#undef FC2_CTS_SDA_SSEL0_PIO1_26
#undef FC2_RTS_SCL_SSEL1_PIO1_27
#undef FC2_RXD_SDA_MOSI_DATA_PIO1_24
#undef FC2_SCK_PIO1_23
#undef FC2_TXD_SCL_MISO_WS_PIO1_25
#undef FC3_CTS_SDA_SSEL0_PIO0_1
#undef FC3_RTS_SCL_SSEL1_PIO0_7
#undef FC3_SCK_PIO0_0
#undef FC3_SSEL2_PIO1_23
#undef FC3_SSEL3_PIO1_24
#undef FC4_CTS_SDA_SSEL0_PIO0_18
#undef FC4_CTS_SDA_SSEL0_PIO1_9
#undef FC4_RTS_SCL_SSEL1_PIO0_19
#undef FC4_RTS_SCL_SSEL1_PIO1_15
#undef FC4_SCK_PIO1_19
#undef FC4_SSEL2_PIO0_17
#undef FC4_SSEL2_PIO1_8
#undef FC4_SSEL3_PIO1_22
#undef FC4_TXD_SCL_MISO_WS_PIO1_20
#undef FC5_CTS_SDA_SSEL0_PIO1_14
#undef FC5_RTS_SCL_SSEL1_PIO1_15
#undef FC5_SCK_PIO0_7
#undef FC6_RTS_SCL_SSEL1_PIO1_17
#undef FC6_RXD_SDA_MOSI_DATA_PIO1_13
#undef FC6_SCK_PIO1_12
#undef FC6_TXD_SCL_MISO_WS_PIO1_16
#undef FC7_CTS_SDA_SSEL0_PIO1_21
#undef FC7_RTS_SCL_SSEL1_PIO1_20
#undef FC7_RXD_SDA_MOSI_DATA_PIO0_20
#undef FC7_RXD_SDA_MOSI_DATA_PIO0_27
#undef FC7_RXD_SDA_MOSI_DATA_PIO1_29
#undef FC7_SCK_PIO0_21
#undef FC7_SCK_PIO1_28
#undef FC7_TXD_SCL_MISO_WS_PIO0_19
#undef FC7_TXD_SCL_MISO_WS_PIO1_30
#undef GPIO_PIO00_PIO0_0
#undef GPIO_PIO017_PIO0_17
#undef GPIO_PIO018_PIO0_18
#undef GPIO_PIO019_PIO0_19
#undef GPIO_PIO01_PIO0_1
#undef GPIO_PIO024_PIO0_24
#undef GPIO_PIO028_PIO0_28
#undef GPIO_PIO031_PIO0_31
#undef GPIO_PIO07_PIO0_7
#undef GPIO_PIO110_PIO1_10
#undef GPIO_PIO111_PIO1_11
#undef GPIO_PIO112_PIO1_12
#undef GPIO_PIO113_PIO1_13
#undef GPIO_PIO114_PIO1_14
#undef GPIO_PIO115_PIO1_15
#undef GPIO_PIO116_PIO1_16
#undef GPIO_PIO117_PIO1_17
#undef GPIO_PIO118_PIO1_18
#undef GPIO_PIO119_PIO1_19
#undef GPIO_PIO120_PIO1_20
#undef GPIO_PIO122_PIO1_22
#undef GPIO_PIO123_PIO1_23
#undef GPIO_PIO124_PIO1_24
#undef GPIO_PIO125_PIO1_25
#undef GPIO_PIO126_PIO1_26
#undef GPIO_PIO127_PIO1_27
#undef GPIO_PIO128_PIO1_28
#undef GPIO_PIO129_PIO1_29
#undef GPIO_PIO130_PIO1_30
#undef GPIO_PIO131_PIO1_31
#undef GPIO_PIO16_PIO1_6
#undef GPIO_PIO17_PIO1_7
#undef GPIO_PIO18_PIO1_8
#undef GPIO_PIO19_PIO1_9
#undef HS_SPI_SSEL2_PIO1_12
#undef HS_SPI_SSEL3_PIO1_26
#undef MCLK_PIO1_31
#undef PINT_PINT0_PIO0_0
#undef PINT_PINT0_PIO0_1
#undef PINT_PINT0_PIO0_17
#undef PINT_PINT0_PIO0_18
#undef PINT_PINT0_PIO0_19
#undef PINT_PINT0_PIO0_24
#undef PINT_PINT0_PIO0_28
#undef PINT_PINT0_PIO0_31
#undef PINT_PINT0_PIO0_7
#undef PINT_PINT0_PIO1_10
#undef PINT_PINT0_PIO1_11
#undef PINT_PINT0_PIO1_12
#undef PINT_PINT0_PIO1_13
#undef PINT_PINT0_PIO1_14
#undef PINT_PINT0_PIO1_15
#undef PINT_PINT0_PIO1_16
#undef PINT_PINT0_PIO1_17
#undef PINT_PINT0_PIO1_18
#undef PINT_PINT0_PIO1_19
#undef PINT_PINT0_PIO1_20
#undef PINT_PINT0_PIO1_22
#undef PINT_PINT0_PIO1_23
#undef PINT_PINT0_PIO1_24
#undef PINT_PINT0_PIO1_25
#undef PINT_PINT0_PIO1_26
#undef PINT_PINT0_PIO1_27
#undef PINT_PINT0_PIO1_28
#undef PINT_PINT0_PIO1_29
#undef PINT_PINT0_PIO1_30
#undef PINT_PINT0_PIO1_31
#undef PINT_PINT0_PIO1_6
#undef PINT_PINT0_PIO1_7
#undef PINT_PINT0_PIO1_8
#undef PINT_PINT0_PIO1_9
#undef PINT_PINT1_PIO0_0
#undef PINT_PINT1_PIO0_1
#undef PINT_PINT1_PIO0_17
#undef PINT_PINT1_PIO0_18
#undef PINT_PINT1_PIO0_19
#undef PINT_PINT1_PIO0_24
#undef PINT_PINT1_PIO0_28
#undef PINT_PINT1_PIO0_31
#undef PINT_PINT1_PIO0_7
#undef PINT_PINT1_PIO1_10
#undef PINT_PINT1_PIO1_11
#undef PINT_PINT1_PIO1_12
#undef PINT_PINT1_PIO1_13
#undef PINT_PINT1_PIO1_14
#undef PINT_PINT1_PIO1_15
#undef PINT_PINT1_PIO1_16
#undef PINT_PINT1_PIO1_17
#undef PINT_PINT1_PIO1_18
#undef PINT_PINT1_PIO1_19
#undef PINT_PINT1_PIO1_20
#undef PINT_PINT1_PIO1_22
#undef PINT_PINT1_PIO1_23
#undef PINT_PINT1_PIO1_24
#undef PINT_PINT1_PIO1_25
#undef PINT_PINT1_PIO1_26
#undef PINT_PINT1_PIO1_27
#undef PINT_PINT1_PIO1_28
#undef PINT_PINT1_PIO1_29
#undef PINT_PINT1_PIO1_30
#undef PINT_PINT1_PIO1_31
#undef PINT_PINT1_PIO1_6
#undef PINT_PINT1_PIO1_7
#undef PINT_PINT1_PIO1_8
#undef PINT_PINT1_PIO1_9
#undef PINT_PINT2_PIO0_0
#undef PINT_PINT2_PIO0_1
#undef PINT_PINT2_PIO0_17
#undef PINT_PINT2_PIO0_18
#undef PINT_PINT2_PIO0_19
#undef PINT_PINT2_PIO0_24
#undef PINT_PINT2_PIO0_28
#undef PINT_PINT2_PIO0_31
#undef PINT_PINT2_PIO0_7
#undef PINT_PINT2_PIO1_10
#undef PINT_PINT2_PIO1_11
#undef PINT_PINT2_PIO1_12
#undef PINT_PINT2_PIO1_13
#undef PINT_PINT2_PIO1_14
#undef PINT_PINT2_PIO1_15
#undef PINT_PINT2_PIO1_16
#undef PINT_PINT2_PIO1_17
#undef PINT_PINT2_PIO1_18
#undef PINT_PINT2_PIO1_19
#undef PINT_PINT2_PIO1_20
#undef PINT_PINT2_PIO1_22
#undef PINT_PINT2_PIO1_23
#undef PINT_PINT2_PIO1_24
#undef PINT_PINT2_PIO1_25
#undef PINT_PINT2_PIO1_26
#undef PINT_PINT2_PIO1_27
#undef PINT_PINT2_PIO1_28
#undef PINT_PINT2_PIO1_29
#undef PINT_PINT2_PIO1_30
#undef PINT_PINT2_PIO1_31
#undef PINT_PINT2_PIO1_6
#undef PINT_PINT2_PIO1_7
#undef PINT_PINT2_PIO1_8
#undef PINT_PINT2_PIO1_9
#undef PINT_PINT3_PIO0_0
#undef PINT_PINT3_PIO0_1
#undef PINT_PINT3_PIO0_17
#undef PINT_PINT3_PIO0_18
#undef PINT_PINT3_PIO0_19
#undef PINT_PINT3_PIO0_24
#undef PINT_PINT3_PIO0_28
#undef PINT_PINT3_PIO0_31
#undef PINT_PINT3_PIO0_7
#undef PINT_PINT3_PIO1_10
#undef PINT_PINT3_PIO1_11
#undef PINT_PINT3_PIO1_12
#undef PINT_PINT3_PIO1_13
#undef PINT_PINT3_PIO1_14
#undef PINT_PINT3_PIO1_15
#undef PINT_PINT3_PIO1_16
#undef PINT_PINT3_PIO1_17
#undef PINT_PINT3_PIO1_18
#undef PINT_PINT3_PIO1_19
#undef PINT_PINT3_PIO1_20
#undef PINT_PINT3_PIO1_22
#undef PINT_PINT3_PIO1_23
#undef PINT_PINT3_PIO1_24
#undef PINT_PINT3_PIO1_25
#undef PINT_PINT3_PIO1_26
#undef PINT_PINT3_PIO1_27
#undef PINT_PINT3_PIO1_28
#undef PINT_PINT3_PIO1_29
#undef PINT_PINT3_PIO1_30
#undef PINT_PINT3_PIO1_31
#undef PINT_PINT3_PIO1_6
#undef PINT_PINT3_PIO1_7
#undef PINT_PINT3_PIO1_8
#undef PINT_PINT3_PIO1_9
#undef PINT_PINT4_PIO0_0
#undef PINT_PINT4_PIO0_1
#undef PINT_PINT4_PIO0_17
#undef PINT_PINT4_PIO0_18
#undef PINT_PINT4_PIO0_19
#undef PINT_PINT4_PIO0_24
#undef PINT_PINT4_PIO0_28
#undef PINT_PINT4_PIO0_31
#undef PINT_PINT4_PIO0_7
#undef PINT_PINT4_PIO1_10
#undef PINT_PINT4_PIO1_11
#undef PINT_PINT4_PIO1_12
#undef PINT_PINT4_PIO1_13
#undef PINT_PINT4_PIO1_14
#undef PINT_PINT4_PIO1_15
#undef PINT_PINT4_PIO1_16
#undef PINT_PINT4_PIO1_17
#undef PINT_PINT4_PIO1_18
#undef PINT_PINT4_PIO1_19
#undef PINT_PINT4_PIO1_20
#undef PINT_PINT4_PIO1_22
#undef PINT_PINT4_PIO1_23
#undef PINT_PINT4_PIO1_24
#undef PINT_PINT4_PIO1_25
#undef PINT_PINT4_PIO1_26
#undef PINT_PINT4_PIO1_27
#undef PINT_PINT4_PIO1_28
#undef PINT_PINT4_PIO1_29
#undef PINT_PINT4_PIO1_30
#undef PINT_PINT4_PIO1_31
#undef PINT_PINT4_PIO1_6
#undef PINT_PINT4_PIO1_7
#undef PINT_PINT4_PIO1_8
#undef PINT_PINT4_PIO1_9
#undef PINT_PINT5_PIO0_0
#undef PINT_PINT5_PIO0_1
#undef PINT_PINT5_PIO0_17
#undef PINT_PINT5_PIO0_18
#undef PINT_PINT5_PIO0_19
#undef PINT_PINT5_PIO0_24
#undef PINT_PINT5_PIO0_28
#undef PINT_PINT5_PIO0_31
#undef PINT_PINT5_PIO0_7
#undef PINT_PINT5_PIO1_10
#undef PINT_PINT5_PIO1_11
#undef PINT_PINT5_PIO1_12
#undef PINT_PINT5_PIO1_13
#undef PINT_PINT5_PIO1_14
#undef PINT_PINT5_PIO1_15
#undef PINT_PINT5_PIO1_16
#undef PINT_PINT5_PIO1_17
#undef PINT_PINT5_PIO1_18
#undef PINT_PINT5_PIO1_19
#undef PINT_PINT5_PIO1_20
#undef PINT_PINT5_PIO1_22
#undef PINT_PINT5_PIO1_23
#undef PINT_PINT5_PIO1_24
#undef PINT_PINT5_PIO1_25
#undef PINT_PINT5_PIO1_26
#undef PINT_PINT5_PIO1_27
#undef PINT_PINT5_PIO1_28
#undef PINT_PINT5_PIO1_29
#undef PINT_PINT5_PIO1_30
#undef PINT_PINT5_PIO1_31
#undef PINT_PINT5_PIO1_6
#undef PINT_PINT5_PIO1_7
#undef PINT_PINT5_PIO1_8
#undef PINT_PINT5_PIO1_9
#undef PINT_PINT6_PIO0_0
#undef PINT_PINT6_PIO0_1
#undef PINT_PINT6_PIO0_17
#undef PINT_PINT6_PIO0_18
#undef PINT_PINT6_PIO0_19
#undef PINT_PINT6_PIO0_24
#undef PINT_PINT6_PIO0_28
#undef PINT_PINT6_PIO0_31
#undef PINT_PINT6_PIO0_7
#undef PINT_PINT6_PIO1_10
#undef PINT_PINT6_PIO1_11
#undef PINT_PINT6_PIO1_12
#undef PINT_PINT6_PIO1_13
#undef PINT_PINT6_PIO1_14
#undef PINT_PINT6_PIO1_15
#undef PINT_PINT6_PIO1_16
#undef PINT_PINT6_PIO1_17
#undef PINT_PINT6_PIO1_18
#undef PINT_PINT6_PIO1_19
#undef PINT_PINT6_PIO1_20
#undef PINT_PINT6_PIO1_22
#undef PINT_PINT6_PIO1_23
#undef PINT_PINT6_PIO1_24
#undef PINT_PINT6_PIO1_25
#undef PINT_PINT6_PIO1_26
#undef PINT_PINT6_PIO1_27
#undef PINT_PINT6_PIO1_28
#undef PINT_PINT6_PIO1_29
#undef PINT_PINT6_PIO1_30
#undef PINT_PINT6_PIO1_31
#undef PINT_PINT6_PIO1_6
#undef PINT_PINT6_PIO1_7
#undef PINT_PINT6_PIO1_8
#undef PINT_PINT6_PIO1_9
#undef PINT_PINT7_PIO0_0
#undef PINT_PINT7_PIO0_1
#undef PINT_PINT7_PIO0_17
#undef PINT_PINT7_PIO0_18
#undef PINT_PINT7_PIO0_19
#undef PINT_PINT7_PIO0_24
#undef PINT_PINT7_PIO0_28
#undef PINT_PINT7_PIO0_31
#undef PINT_PINT7_PIO0_7
#undef PINT_PINT7_PIO1_10
#undef PINT_PINT7_PIO1_11
#undef PINT_PINT7_PIO1_12
#undef PINT_PINT7_PIO1_13
#undef PINT_PINT7_PIO1_14
#undef PINT_PINT7_PIO1_15
#undef PINT_PINT7_PIO1_16
#undef PINT_PINT7_PIO1_17
#undef PINT_PINT7_PIO1_18
#undef PINT_PINT7_PIO1_19
#undef PINT_PINT7_PIO1_20
#undef PINT_PINT7_PIO1_22
#undef PINT_PINT7_PIO1_23
#undef PINT_PINT7_PIO1_24
#undef PINT_PINT7_PIO1_25
#undef PINT_PINT7_PIO1_26
#undef PINT_PINT7_PIO1_27
#undef PINT_PINT7_PIO1_28
#undef PINT_PINT7_PIO1_29
#undef PINT_PINT7_PIO1_30
#undef PINT_PINT7_PIO1_31
#undef PINT_PINT7_PIO1_6
#undef PINT_PINT7_PIO1_7
#undef PINT_PINT7_PIO1_8
#undef PINT_PINT7_PIO1_9
#undef PLU_CLKIN_PIO1_25
#undef PLU_INPUT0_PIO1_31
#undef PLU_INPUT1_PIO1_30
#undef PLU_INPUT2_PIO0_17
#undef PLU_INPUT2_PIO1_29
#undef PLU_INPUT3_PIO0_18
#undef PLU_INPUT3_PIO1_28
#undef PLU_INPUT4_PIO0_19
#undef PLU_INPUT4_PIO1_27
#undef PLU_INPUT5_PIO1_26
#undef PLU_OUT0_PIO1_18
#undef PLU_OUT1_PIO0_28
#undef PLU_OUT1_PIO1_19
#undef PLU_OUT2_PIO1_20
#undef PLU_OUT4_PIO1_22
#undef PLU_OUT5_PIO1_23
#undef PLU_OUT6_PIO1_24
#undef PMC_ACMP_IN1_PIO0_0
#undef PMC_ACMP_IN3_PIO0_18
#undef PMC_ACMP_IN4_PIO1_14
#undef SCT0_IN0_PIO0_0
#undef SCT0_IN0_PIO0_1
#undef SCT0_IN0_PIO0_17
